// src/Amharic.js
import React from 'react';
import './SecurityCheckpoint.css'; // Create a CSS file for styling if needed

function Amharic() {
  return (
    <div className="security-checkpoint">
      <h2>ክፍል 1 - የደህንነት ፍተሻ</h2>
      <p>
        እንኳን በደህና መጡ፣ አዲስ የPSA አገልግሎት ረዳቶች! 
        የPSA ቡድንን በመቀላቀልዎ እንኳን ደስ አለዎት! በጣም ደስ ብሎናል። 
        ይህን አዲስ ጉዞ ሲጀምሩ በBWI አየር ማረፊያ ያለውን የደህንነት አሰራር መረዳት በጣም አስፈላጊ ነው። 
        ለሁሉም ተሳፋሪዎች ደህንነቱ የተጠበቀ እና ቀልጣፋ አካባቢን ለመጠበቅ የእርስዎ ትብብር ወሳኝ ነው።
      </p>
      <h3>የደህንነት ፍተሻ ሂደቶች</h3>
      <p>
        BWI አየር ማረፊያ አራት የደህንነት ኬላዎች አሉት። 
        SouthWest አየር መንገድ የሚንቀሳቀሰው በፍተሻ ነጥቦች A፣ B እና C ነው። 
        እያንዳንዳቸው የፍተሻ ኬላዎች የተለያዩ የደህንነት መስመሮችን ይሰጣሉ፡ Clear፣ TSA PreCheck፣ Regular እና Employee።
      </p>
      <ol>
        <li>በፍተሻ ነጥቡ ላይ ባጅዎን ይቃኙ እና የይለፍ ቃልዎን ያስገቡ። የይለፍ ቃልህን ከማንም ጋር አታጋራ።</li>
        <li>ባጅዎን ለደህንነት መኮንን ያቅርቡ። ከደህንነት መኮንኖች ጋር ሙሉ በሙሉ ይተባበሩ።</li>
        <li>በደህንነት ስካነር በኩል ማለፍ።</li>
        <li>ከተቃኙ በኋላ ባጅዎን ለሌላ የደህንነት መኮንን ያቅርቡ።</li>
      </ol>
      <p>
        እነዚህን እርምጃዎች ከጨረሱ በኋላ, በአውሮፕላን ማረፊያው ደህንነቱ በተጠበቀ ቦታ ውስጥ ይሆናሉ.
        እነዚህን ሂደቶች በመከተል ለሁሉም ተሳፋሪዎች ደህንነት እና ደህንነት አስተዋፅኦ ያደርጋሉ። ለትብብርዎ እናመሰግናለን!
      </p>
      <p>
        ያስታውሱ፡ እንደ አገልግሎት ረዳትነት ያለዎት ሚና የላቀ የደንበኞች አገልግሎት ለማቅረብ ወሳኝ ነው። 
        ለPSA ቡድን ያደረጋችሁትን አስተዋፅዖ በጉጉት እንጠብቃለን።
      </p>
      <p>በድጋሚ እንኳን ደህና መጣህ!</p>
    </div>
  );
}

export default Amharic;
