import React from 'react';
import './SecurityCheckpoint.css'; // Create a CSS file for styling if needed

function Arabic() {
  return (
    <div className="security-checkpoint arab">
      <h2>الجزء 1 - نقطة التفتيش الأمنية</h2>
      <p>
        مرحبًا بكم، موظفي خدمة PSA الجدد!
        تهانينا على الانضمام إلى فريق PSA! نحن متحمسون لوجودكم معنا.
        مع بدء هذه الرحلة الجديدة، من الضروري فهم إجراءات الأمان في مطار BWI. تعاونكم أمر حاسم للحفاظ على بيئة آمنة وفعالة لجميع الركاب.
      </p>
      <h3>إجراءات نقطة التفتيش الأمنية</h3>
      <p>
        يحتوي مطار BWI على أربع نقاط تفتيش أمنية. تعمل خطوط Southwest Airlines عبر نقاط التفتيش A و B و C. كل من هذه النقاط تقدم خطوط أمان مختلفة: Clear و TSA Pre-Check و Regular و Employee.
      </p>
      <ol>
        <li>امسح شارتك عند نقطة التفتيش وأدخل كلمة المرور الخاصة بك. لا تشارك كلمة مرورك مع أي شخص.</li>
        <li>قدّم شارتك إلى موظف الأمن. تعاون تمامًا مع موظفي الأمن.</li>
        <li>مرر عبر جهاز الفحص الأمني.</li>
        <li>قدّم شارتك إلى موظف أمني آخر بعد الفحص.</li>
      </ol>
      <p>
        بعد إكمال هذه الخطوات، ستكون في منطقة الأمان بالمطار.
        من خلال اتباع هذه الإجراءات، تساهم في سلامة ورفاهية جميع الركاب. شكرًا لتعاونكم!
      </p>
      <p>
        تذكر: دورك كمساعد خدمة حيوي لتقديم خدمة عملاء ممتازة. نتطلع إلى مساهماتك في فريق PSA.
        مرحبًا بك مرة أخرى!
      </p>
    </div>
  );
}

export default Arabic;
