import React from 'react';
import './SecurityCheckpoint.css'; // Create a CSS file for styling if needed

function Nepali() {
  return (
    <div className="security-checkpoint nep">
      <h2>भाग 1 - सुरक्षा चेकप्वाइंट</h2>
      <p>
        स्वागत छ, नयाँ PSA सेवा सहयोगीहरू!
        PSA टोलीमा सामेल हुनको लागि तपाईंलाई बधाई! हामी तपाईंलाई सँगै पाउँदा उत्साहित छौं।
        जब तपाईंले यो नयाँ यात्रा सुरु गर्नुहुन्छ, BWI विमानस्थलमा सुरक्षा प्रक्रिया बुझ्न महत्त्वपूर्ण छ। सबै यात्रुहरूका लागि सुरक्षित र प्रभावकारी वातावरण कायम राख्नको लागि तपाईंको सहकार्य महत्त्वपूर्ण छ।
      </p>
      <h3>सुरक्षा चेक प्रक्रिया</h3>
      <p>
        BWI विमानस्थलमा चार सुरक्षा चेकप्वाइंटहरू छन्। Southwest Airlines चेकप्वाइंट A, B, र C मार्फत संचालन गर्दछ। यी प्रत्येक चेकप्वाइंटले विभिन्न सुरक्षा लाइन्स प्रदान गर्छ: Clear, TSA Pre-Check, Regular, र Employee।
      </p>
      <ol>
        <li>चेकप्वाइंटमा आफ्नो बैज स्क्यान गर्नुहोस् र आफ्नो पासवर्ड प्रविष्ट गर्नुहोस्। आफ्नो पासवर्डलाई कुनैसँग पनि साझा नगर्नुहोस्।</li>
        <li>सुरक्षा अधिकृतलाई आफ्नो बैज देखाउनुहोस्। सुरक्षा अधिकृतहरूसँग पूर्ण रूपमा सहयोग गर्नुहोस्।</li>
        <li>सुरक्षा स्क्यानरमार्फत जानुहोस्।</li>
        <li>स्क्यान पछि अर्को सुरक्षा अधिकृतलाई आफ्नो बैज देखाउनुहोस्।</li>
      </ol>
      <p>
        यी चरणहरू पूरा गरेपछि, तपाईं विमानस्थलको सुरक्षित क्षेत्रमा हुनुहुनेछ।
        यी प्रक्रियाहरू अनुसरण गरेर, तपाईं सबै यात्रुहरूको सुरक्षा र कल्याणमा योगदान दिनुहुन्छ। तपाईंको सहकार्यको लागि धन्यवाद!
      </p>
      <p>
        सम्झनुहोस्: ग्राहक सेवामा तपाईंको भूमिका महत्त्वपूर्ण छ। हामी PSA टोलीमा तपाईंको योगदानको प्रतीक्षा गर्दैछौं।
        पुन: स्वागत छ!
      </p>
    </div>
  );
}

export default Nepali;
